projects/selftest.org
#+title: Self-test and nonlocality detection
#+include: ../config/index-setup.org

#+begin_abstract
This report presents the work carried out on self-testing and nonlocality
detection in the context of the /Advanced Quantum Information Project/ (PQIA).
Nonlocality is studied through the prism of semi-definite programming - used
herein for the numerical simulation and characterization of specific Bell
scenarios - and its application to self-testing is examined.  Particular
attention is given to the retrieval of Bell inequalities, and a novel approach
for the study of local and nonlocal behaviours using nonlinear optimization is
described.
#+end_abstract

* Introduction
  :PROPERTIES:
  :CUSTOM_ID: introduction
  :END:

Before the advent of quantum mechanics in the beginning of the century,
physicists held three fundamental beliefs about the nature of the
universe: /determinism/ (or /causal determinism/), i.e. events in a
given paradigm are bound by causality in such a way that any state is
completely determined by prior states; /reality/, i.e. the universe
exists independently of observation; and /locality/ (or /local
causality/), i.e. what happens in a given space-time region should not
influence what happens in another, space-like separated region. Quantum
mechanics challenged each one of these notions
\cite{nielsen_quantum_2010}.

Non-locality in particular posed the most problems: it was the
corner-stone of Einstein, Podolsky and Rosen's argument in 1935 for the
incompleteness of quantum mechanics \cite{epr}. Since it seemed to be
possible for two spatially-separated parties sharing an entangled state
to influence each other's measurements, resulting in /faster-than-light
communications/, they argued that such a behaviour was paradoxical (this
became known as the /EPR paradox/), and postulated that quantum
mechanics should be compatible with a /hidden local variable
description/, in which non-local effects would not be allowed.

For more than 30 years, /local-realist/ description of quantum theory
were not fully discarded. One had to wait until 1964, when
\citeauthor{bell_einstein_1964} proposed an experiment which would
definitively decide whether or not certain physical effects of quantum
entanglement could be reproduced by local hidden variables: the /Bell
test/ \cite{bell_einstein_1964}. He proposed a condition, known as
/Bell's inequality/, that any physical experiment has to satisfy if
nature could be faithfully described by a classical local hidden
variable theory. Subsequently, several experiments
\cite{aspect_experiment} have been designed that have violated Bell's
inequality, proving that no hidden variable theory can describe certain
phenomenons predicted by quantum mechanics.

Since the 1960s, the field of /Bell nonlocality/ has grown quite
considerably \cite{brunner}, especially with the establishment of
/quantum information science/, where nonlocality plays a central role
\cite{nielsen_quantum_2010}. It is at the heart of /device-independent/
(/d.i./) protocols such as /self-testing/
\cite{2020-self-testing-a-review}, /d.i. quantum key distribution/
\cite{di-qkd}, /d.i. randomness generation/ \cite{di-random}, and
/delegated blind quantum computing/ \cite{blind-aaronson}.

sets the stage for the rest of the report, establishing the relevant
theoretical background and framework. Subsequently, deeper attention is
given to the two main bodies of work: nonlocality detection ( ) and the
retrieval of Bell inequalities ( ). In , the limits of locality
detection in noisy systems are studied, and lastly, in , a nonlinear
approach to study of nonlocality is described.

