projects/selftest.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-05-10 Tue 11:26 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Self-test and nonlocality detection</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="../config/index.css" />
<div id="preamble" class="status">
<header>
<div class="banner">
<a id="myname" href="/">Hugo Abreu</a>
<hr>
<nav>
<p>
<a href="https://hugo-abreu.github.io/">Home</a>
<a href="https://hugo-abreu.github.io/posts.html">Posts</a>
<a href="https://hugo-abreu.github.io/projects.html">Projects</a>
<a href="https://hugo-abreu.github.io/notes.html">Notes</a>
<a href="https://flickr.com/photos/hugo-abreu">Photography</a>
<a href="https://hugo-abreu.github.io/about.html">About</a>
</p>
</nav>
</div>
</header>
</div>
</head>
<body>
<div id="content" class="content">
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#introduction">Introduction</a></li>
<li><a href="#seq:theoretical-framework">Theoretical Framework</a>
<ul>
<li><a href="#sec:char-corr">Characterizing correlations</a>
<ul>
<li><a href="#local-correlations">Local correlations</a></li>
<li><a href="#quantum-correlations">Quantum correlations</a></li>
<li><a href="#no-signaling-correlations">No-signaling correlations</a></li>
<li><a href="#correlation-spaces-and-facet-bell-inequalities">Correlation spaces and facet Bell inequalities</a></li>
</ul>
</li>
<li><a href="#self-testing-of-quantum-states">Self-testing of quantum states</a></li>
<li><a href="#chsh-correlations">CHSH correlations</a></li>
<li><a href="#mayers-yao-correlations">Mayers-Yao correlations</a></li>
</ul>
</li>
<li><a href="#sec:nonloc-detection">Non-locality detection</a>
<ul>
<li><a href="#primal-LP">Linear Programming formulation</a></li>
<li><a href="#CHSH_primal">CHSH correlations</a></li>
<li><a href="#mayers-yaos-correlations">Mayers-Yao's correlations</a></li>
</ul>
</li>
<li><a href="#seq:ineq-dual">Inequalities from duality</a>
<ul>
<li><a href="#chsh-correlations-1">CHSH correlations</a></li>
<li><a href="#mayers-yaos-correlation">Mayers-Yao's correlation</a></li>
<li><a href="#restricted-inputs-on-alice-side-for-mayers-yaos-self-test">Restricted inputs on Alice side for Mayers-Yao's self-test</a></li>
<li><a href="#alternative-dual-formulation">Alternative dual formulation</a></li>
</ul>
</li>
<li><a href="#sec:noise">Robustness against white noise</a></li>
<li><a href="#sec:non-linear">Non-linear programming</a>
<ul>
<li><a href="#finding-the-optimal-probability-distribution">Finding the optimal probability distribution</a></li>
<li><a href="#making-a-behavior-local">Making a behavior local</a></li>
</ul>
</li>
<li><a href="#sec:math-opt">Mathematical optimization</a>
<ul>
<li><a href="#linear-optimization">Linear optimization</a></li>
<li><a href="#nonlinear-optimization">Nonlinear optimization</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div class="abstract" id="org1760590">
<p>
This report presents the work carried out on self-testing and nonlocality
detection in the context of the <i>Advanced Quantum Information Project</i> (PQIA).
Nonlocality is studied through the prism of semi-definite programming - used
herein for the numerical simulation and characterization of specific Bell
scenarios - and its application to self-testing is examined.  Particular
attention is given to the retrieval of Bell inequalities, and a novel approach
for the study of local and nonlocal behaviours using nonlinear optimization is
described.
</p>

</div>

<div id="outline-container-introduction" class="outline-2">
<h2 id="introduction">Introduction</h2>
<div class="outline-text-2" id="text-introduction">
<p>
Before the advent of quantum mechanics in the beginning of the century,
physicists held three fundamental beliefs about the nature of the
universe: <i>determinism</i> (or <i>causal determinism</i>), i.e. events in a
given paradigm are bound by causality in such a way that any state is
completely determined by prior states; <i>reality</i>, i.e. the universe
exists independently of observation; and <i>locality</i> (or <i>local
causality</i>), i.e. what happens in a given space-time region should not
influence what happens in another, space-like separated region. Quantum
mechanics challenged each one of these notions
\cite{nielsen_quantum_2010}.
</p>

<p>
Non-locality in particular posed the most problems: it was the
corner-stone of Einstein, Podolsky and Rosen's argument in 1935 for the
incompleteness of quantum mechanics \cite{epr}. Since it seemed to be
possible for two spatially-separated parties sharing an entangled state
to influence each other's measurements, resulting in <i>faster-than-light
communications</i>, they argued that such a behaviour was paradoxical (this
became known as the <i>EPR paradox</i>), and postulated that quantum
mechanics should be compatible with a <i>hidden local variable
description</i>, in which non-local effects would not be allowed.
</p>

<p>
For more than 30 years, <i>local-realist</i> description of quantum theory
were not fully discarded. One had to wait until 1964, when
\citeauthor{bell_einstein_1964} proposed an experiment which would
definitively decide whether or not certain physical effects of quantum
entanglement could be reproduced by local hidden variables: the <i>Bell
test</i> \cite{bell_einstein_1964}. He proposed a condition, known as
<i>Bell's inequality</i>, that any physical experiment has to satisfy if
nature could be faithfully described by a classical local hidden
variable theory. Subsequently, several experiments
\cite{aspect_experiment} have been designed that have violated Bell's
inequality, proving that no hidden variable theory can describe certain
phenomenons predicted by quantum mechanics.
</p>

<p>
Since the 1960s, the field of <i>Bell nonlocality</i> has grown quite
considerably \cite{brunner}, especially with the establishment of
<i>quantum information science</i>, where nonlocality plays a central role
\cite{nielsen_quantum_2010}. It is at the heart of <i>device-independent</i>
(<i>d.i.</i>) protocols such as <i>self-testing</i>
\cite{2020-self-testing-a-review}, <i>d.i. quantum key distribution</i>
\cite{di-qkd}, <i>d.i. randomness generation</i> \cite{di-random}, and
<i>delegated blind quantum computing</i> \cite{blind-aaronson}.
</p>

<p>
sets the stage for the rest of the report, establishing the relevant
theoretical background and framework. Subsequently, deeper attention is
given to the two main bodies of work: nonlocality detection ( ) and the
retrieval of Bell inequalities ( ). In , the limits of locality
detection in noisy systems are studied, and lastly, in , a nonlinear
approach to study of nonlocality is described.
</p>
</div>
</div>
