projects/selftest.html

<div id="outline-container-seq:theoretical-framework" class="outline-2">
<h2 id="seq:theoretical-framework">Theoretical Framework</h2>
<div class="outline-text-2" id="text-seq:theoretical-framework">
<p>
Nonlocal behaviours were first predicted and formulated in the context
of entangled spin one-half particles \cite{epr}. With the establishment
of Bell nonlocality as a standalone field, specific physical scenarios
were replaced with more implementation-agnostic frameworks
\cite{brunner}. In this report, <i>Bell scenarios</i>, first introduced by
\citeauthor{bell_einstein_1964} in \citeyear{bell_einstein_1964}
\cite{bell_einstein_1964}, are considered.
</p>

<p>
In a Bell scenario, two parties <i>Alice</i> and <i>Bob</i>, sharing a quantum
state \(\ket{\psi}\) on which they can perform valid measurements \(M\) and
\(N\), are considered. Each party has \(m\) choices of measurement and
\(\Delta\) possible outcomes.
</p>

<p>
The <i>outputs</i> are denoted \((a,b)\) and the <i>inputs</i> \((x,y)\), as is
depicted in . For the rest of the report, only Bell scenarios in which
\(\Delta = 2\) and \(m \in \{2 ,3\}\) are considered.
</p>

<p>
From one experiment to another, the outcomes \(a\) and \(b\) that are
obtained may vary, even if Alice and Bob use the same measurement
operators. As such, these outcomes can be described via a <i>probability
distribution</i> \cite{brunner}.
</p>

<p>
This elements of this probability distribution are referred to as <i>joint
probabilities</i>, and are denoted \(p(a,b|x,y)\). The vector of all joint
probabilities \(\mathcal{P} = \{p(a,b|x,y)\}\) describes the operation of
the Bell scenario and is referred to as the <i>behaviour</i> () or the
<i>correlations</i> of the scenario.
</p>

<p>
[def:behaviour] A behavior or correlations is a vector
\(\mathcal{P} = \{p(a,b|x,y)\}\) of all joint probabilities to obtain the
output pair \((a,b)\) given the input pair \((x,y)\).
</p>

<p>
An interesting property of this definition, is that a behavior can be
seen as a point \(\mathcal{P}\) in the vector space
\(\mathbbm{R}^{\Delta^2 m^2}\). This property will be useful for the
expression of behaviours with semi-definite programming in .
</p>

<p>
To construct <i>valid behaviours</i>, one must ensure that it verifies
certain conditions: essentially, the behaviour must constitute a <i>valid
probability distribution</i> \cite{brunner}.
</p>

<p>
A behaviour \(\mathcal{P}\) must satisfy two conditions: it must be
<i>positive</i>, i.e. \(\forall a, b, x, y\), \[\label{eq:norm_cons_1}
    p(a,b|x,y) \geq 0 \text{,}\] and it must be <i>normalized</i>,
i.e. \(\forall x,y \in \{1,m\}\), \[\label{eq:norm_cons_2}
\sum_{a,b=1}^m p(a,b|x,y) = 1 \text{.}\]
</p>

<p>
Several types of behaviours exist: with this formalism, one can express
both <i>local</i>, <i>quantum</i> and <i>no-signalling</i> behaviours, respectively
referred to by the probability spaces to which they belong:
\(\mathcal{L}\), \(\mathcal{Q}\) and \(\mathcal{NS}\) (this will be addressed
in more detail in ). In the rest of the report, the space
\(\mathcal{K} \in \{\mathcal{L}, \mathcal{Q}, \mathcal{NS}\}\) will be
used to refer to the probability space of an arbitrary valid behaviour.
</p>
</div>

<div id="outline-container-sec:char-corr" class="outline-3">
<h3 id="sec:char-corr">Characterizing correlations</h3>
<div class="outline-text-3" id="text-sec:char-corr">
<p>
When considering two distant observers \(A\) and \(B\) performing
measurements on a shared physical system, correlations arise as an
important property of the system \cite{bell-viol-self-test}.
</p>

<p>
In this subsection, both local, quantum and no-signaling correlations
are described.
</p>
</div>

<div id="outline-container-local-correlations" class="outline-4">
<h4 id="local-correlations">Local correlations</h4>
<div class="outline-text-4" id="text-local-correlations">
<p>
Local correlations correspond to behaviours that are allowed in
classical physics: informally, they enforce the fact that the two
observers \(A\) and \(B\) cannot communicate before outputting \(a\) and \(b\).
formalizes this notion:
</p>

<p>
[def:local-corr] A behaviour \(\mathcal{P}\) is said to be local if its
joint probabilities \(p(a,b|x,y)\) can be written
\[p(a,b|x,y) = \int_\Lambda q(\lambda) p(a|x,\lambda)p(b|y,\lambda)
    \mathrm{d}\lambda\] where \(\lambda \in \Lambda\) are local hidden
variables with a probability density distribution \(q(\lambda)\).
Otherwise, the correlations are non local.<br />
</p>

<p>
Local correlations can also be expressed in a simpler form, in terms of
deterministic local hidden-variable models - in what is referred to as a
local deterministic behaviour (). The equivalence of these two
definitions follows from the fact any local randomness present in
\(p(a | x, \lambda)\) and \(p(b | y, \lambda)\) can be incorporated in the
shared random variable \(\lambda\) \cite{brunner}.
</p>

<p>
[def:local-det-beh] Let \(\lambda=(a_1,\ldots,a_m\,;\,b_1,\ldots,b_m)\) be
the assignment of outputs \(a_x,b_y\) for each inputs possible. The
corresponding deterministic behaviour is
\[\mathbf{d_\lambda}(a,b|x,y) = \begin{cases} 1 & \text{if } a=a_x \text{ and
    } b=b_y \text{,}\\ 0 & otherwise \text{.} \end{cases}\] There are
\(\Delta^{2m}\) possible deterministic behaviours.
</p>

<p>
One can also give an inductive definition for local behaviours, which
will be useful in the linear programming formulation of :
</p>

<p>
A behaviour \(\mathcal{P}\) is local if and only if it can be
written as a convex combination of deterministic behaviours, i.e
\[\mathcal{P} = \sum_\lambda \mu_\lambda \mathbf{d}_\lambda \ , \ \mu_\lambda
    \geq 0 \ , \ \sum_\lambda \mu_\lambda = 1 \text{.}\]
</p>
</div>
</div>

<div id="outline-container-quantum-correlations" class="outline-4">
<h4 id="quantum-correlations">Quantum correlations</h4>
<div class="outline-text-4" id="text-quantum-correlations">
<p>
Quantum correlations correspond to behaviours that are allowed in
quantum mechanics: they can possess nonlocal characteristics
\cite{bell-viol-self-test}.
</p>

<p>
Let \(\mathcal{H_A} \otimes \mathcal{H_B}\) be the joint Hilbert space of
Alice and Bob and \(\rho_{AB}\) be the quantum states representing their
shared physical system. Let \(\{M_{a|x}\}\) and \(\{N_{b|y}\}\) be the sets
of measurement operators respectively on \(\mathcal{H_A}\) and
\(\mathcal{H_B}\). These measurement operators satisfy \[\begin{aligned}
       \forall x,a,\ & M_{a|x} \succcurlyeq 0 & \text{ and } \
            & \forall x ,\ \sum_a  M_{a|x} = \mathbbm{1}_A \ , \\
       \forall y,b,\ & M_{b|y} \succcurlyeq 0 & \text{ and } \
            & \forall y ,\ \sum_b  M_{b|y} = \mathbbm{1}_B \ ,\\
\end{aligned}\] therefore \(\{M_{a|x}\}\) and \(\{N_{b|y}\}\) characterize
POVMs \cite{nielsen_quantum_2010}, and can thus be experimentally
constructed.
</p>

<p>
The set of behaviours achievable in quantum mechanics \(\mathcal{Q}\)
corresponds to the set of behaviours who verify the following condition:
</p>

<p>
[eq:quant-correlation]
</p>

<p>
A behaviour \(\mathcal{P}\) is quantum if its elements can be written as
\[p(a,b|x,y) = \textrm{Tr}\left(  \rho_{AB}  M_{a|x} \otimes N_{b|y}\right)\]
</p>

<p>
The previous definition works for pure states, but one can always
consider a purification for arbitrary quantum states ().
</p>

<p>
[prop:qu<sub>corr</sub>] Without loss of generality, one can take a purification
\(\Phi\) of \(\rho_{AB}\) and consider \(M_{a|x} ,N_{b|y}\) to be orthogonal
projectors. Hence, quantum behaviour elements can be written
\[p(a,b|x,y) = \bra{\Phi}  M_{a|x} \otimes N_{b|y} \ket{\Phi} \text{.}
        \label{eq:qu_corr}\]
</p>
</div>
</div>
