projects/selftest.html

<div id="outline-container-no-signaling-correlations" class="outline-4">
<h4 id="no-signaling-correlations">No-signaling correlations</h4>
<div class="outline-text-4" id="text-no-signaling-correlations">
<p>
No-signalling constraints state that the marginal probabilities \(p(a|x)\)
(respectively \(p(b|y)\)) are independent of Bob's (respectively Alice's)
measurement, i.e <i>Bob and Alice cannot signal instantaneously their
outputs to each other by their choice of input</i> \cite{brunner}.
</p>

<p>
A behaviour \(\mathcal{P}\) is no-signalling if its elements fulfill the
following constraints \[\begin{aligned}
    \forall \ a,x,y,y'\;  & \ \sum_{b=1}^\Delta p(a,b|x,y) & = &\ \sum_{b=1}^\Delta p(a,b|x,y')  \\
    \forall \ b,y,x,x'\;  & \ \sum_{a=1}^\Delta p(a,b|x,y) & = &\ \sum_{a=1}^\Delta p(a,b|x',y)
\end{aligned}\]
</p>
</div>
</div>

<div id="outline-container-correlation-spaces-and-facet-bell-inequalities" class="outline-4">
<h4 id="correlation-spaces-and-facet-bell-inequalities">Correlation spaces and facet Bell inequalities</h4>
<div class="outline-text-4" id="text-correlation-spaces-and-facet-bell-inequalities">
<p>
The relationship between the three types of correlations can be
visualized in . While the no-signaling and local sets can be easily
characterized, the set of quantum correlations is more difficult to
describe \cite{bell-viol-self-test}, but the property in (introduced by
\citeauthor{popescu_quantum_1994} in \cite{popescu_quantum_1994}) always
holds.
</p>

<p>
[prop:corr] Let \(\mathcal{NS}\), \(\mathcal{Q}\) and \(\mathcal{L}\) be the
set of no-signalling, of quantum and of local correlations. They verify
\[\mathcal{L} \subset \mathcal{Q} \subset \mathcal{NS} \text{,}\] and
\[\dim  \mathcal K = (\Delta - 1)^2 m^2 \text{.}\]
</p>

<p>
The following definitions are important for the characterisation of
Facet Bell inequalities, which are important in the linear programming
formulation.
</p>

<p>
The sets \(\mathcal{L}, \mathcal{Q}\) and \(\mathcal{NS}\) are closed,
bounded and convex.
</p>

<p>
Let \(\mathcal{K}\) be a closed, bounded and convex set. For all
\(\mathcal P_1, \mathcal P_2\) in \(\mathcal L\), and all \(\alpha\) in
\([0, 1]\) the following holds:
\[\alpha  \mathcal{P}_1 + (1-\alpha) \mathcal{P}_2 \in \mathcal{K}\]
</p>

<p>
For all behaviours \(\mathcal P \in \mathcal K\)
\[\exists \mathbf{s} \in \mathbb{R}^t,\  S_k \in \mathbb{R} ,\ \  \mathbf{s}\cdot\mathcal{P} \leq S_k\]
</p>

<p>
For the local set \(\mathcal{L}\), this type of inequalities are called
<i>Bell inequalities</i> and it is said to be violated by a behaviour
\(\mathcal{P'} \notin \mathcal{L}\) whenever
\[\mathbf{s}\cdot\mathcal{P'} > S_l\]
</p>

<p>
Let \(\, \mathbf{s}\,\cdot\,\mathcal{P} \leq S_l\) be a valid Bell
inequality for the polytope \(\mathcal{L}\). Then
\(F = \{ \mathcal{P}\in \mathcal{L}|\mathbf{s}\cdot \mathbf{p} = S_l\}\)
is a face of \(\mathcal{L}\). Besides, if
\(\dim\,F = \dim\, \mathcal{L} - 1\), F is called a facet of \(\mathcal{L}\)
and the corresponding inequalities are called facet Bell inequalities.
</p>

<p>
Hence, Bell inequalities characterize the local set \(\mathcal{L}\), and
thus help to determine whether a behaviour \(\mathcal{P}\) is local or
not. Moreover, Tsirelson's bound provides a characterization of the
quantum set \cite{cirelson_quantum_1980}. It is important to stress that
since the set of quantum behaviours is not a polytope, there exist
infinitely many Tsirelson bounds.
</p>
</div>
</div>
</div>

<div id="outline-container-self-testing-of-quantum-states" class="outline-3">
<h3 id="self-testing-of-quantum-states">Self-testing of quantum states</h3>
<div class="outline-text-3" id="text-self-testing-of-quantum-states">
<p>
Self-testing is a method to recover information on the physics of a
quantum experiment, in a black box scenario, i.e. without needing to
have or to trust a model of the experiment
\cite{2020-self-testing-a-review}.
</p>

<p>
A general method to perform self-testing is now described.
</p>

<p>
The correlations \(p(a,b|x,y)\) self-test the state
\(\ket{\Phi^+}_{A^{'}B^{'}}\) if for any state \(\rho_{AB}\) compatible with
\(p(a,b|x,y)\) and for any purification \(\ket{\Psi}_{ABP}\) of \(\rho_{AB}\),
there exists a local isometry
\[\mathbf{\Phi}_A \otimes \mathbf{\Phi}_B : \mathcal{H}_A \otimes \mathcal{H}_B
    \longrightarrow \mathcal{H}_{A^{'}\Bar{A} } \otimes \mathcal{H}_{B^{'}\Bar{B}} \text{ ,}\]
such that
\[\mathbf{\Phi}_A \otimes \mathbf{\Phi}_B \otimes \mathbbm{1}_P  \left[  \ket{\Psi}_{ABP}
    \right] =  \ket{\Psi^{'}}_{A^{'}B^{'}} \otimes \ket{\xi}_{\Bar{A}\Bar{B}P}\]
[prop:self-test<sub>states</sub>]
</p>

<p>
The extremal points of \(\mathcal{Q}\) can be used to self-test both a
state and a measurement \cite{bell-viol-self-test} and these extremal
points are known to be candidates for observing a maximal violation of a
Bell inequality.
</p>

<p>
In most cases, it is possible to explicitly construct an isometry
\(\mathbf{\Phi}\) mapping the physical state \(\ket{\Psi}\) to the reference
state \(\ket{\Phi^+}\) by using a partial Swap gate. For instance, let's
focus on a Bell scenario with \(x,y\in\{0,1\}\). The main idea is that if
the operators anticommute i.e., \(\{A_0,A_1\}=\{B_0,B_1\}=0\), we can
construct operators \(Z_A,X_A,Z_B,X_B\) whose actions are analogous to
those of the operators used in the 2-qubit Swap gate
</p>

<p>
\[\begin{aligned}
        Z_A = \dfrac{1}{\sqrt{2}} (A_0 +A_1)\ \ &\  \ Z_B = B_0 \\
        X_A = \dfrac{1}{\sqrt{2}} (A_0 +A_1)\ \ &\ \ Z_B = B_0.
    \end{aligned}\]
</p>

<p>
Hence, if \(\ket{\Psi}\) corresponds to the reference state up to an
isometry, the Swap gate as pictured in enables the construction of the
isometry
\[\mathbf{\Phi}\left[ \ket{\Psi}_{ABP}\right] = \ket{\Phi^+}_{A{'}B{'}} \otimes \ket{\xi}_{ABP} \text{ ,}\]
where \(\ket{\Psi}\) is a purification of the physical state, and \(A{'}\)
and \(B{'}\) are the Hilbert spaces of the ancillary qubits. As such, the
reference state is recovered in the ancillary space.
</p>
</div>
</div>
