projects/selftest.org
** CHSH correlations
   :PROPERTIES:
   :CUSTOM_ID: chsh-correlations
   :END:

Consider outputs $a,b \in \{-1,1\}$, and inputs $x,y \in \{0,1\}$.
Letting $\{A_x\}$ be the set of Alice's measurement observables (where
$A_x = M_{1|x} - M_{-1|x}$ with $M_{a|x}$ the measurement operators),
and $\{B_y\}$ the one of Bob, one can express the expected correlations
as $$\begin{aligned}
    \bra{\Phi} A_0\otimes B_0 \ket{\Phi} & = \dfrac{1}{\sqrt{2}} &\
    ,\  & \bra{\Phi} A_0\otimes B_1 \ket{\Phi} & = &\ \dfrac{1}{\sqrt{2}}  \\
    \bra{\Phi} A_1\otimes B_0 \ket{\Phi} & = \dfrac{1}{\sqrt{2}} &\
    ,\  & \bra{\Phi} A_1\otimes B_1 \ket{\Phi} & = & - \dfrac{1}{\sqrt{2}}  \\
    \bra{\Phi} A_x\otimes \mathbbm{1_B} \ket{\Phi} & = 0\   \forall x &\ ,\
    & \bra{\Phi} \mathbbm{1_A}\otimes B_y \ket{\Phi} & = & \ 0 \  \forall y \text{.}
\end{aligned} \label{eq:corr_chsh}$$

These correlations can be obtained if Alice and Bob share the quantum
state
$$\ket{\Phi} = \dfrac{1}{\sqrt{2}} \big( \ket{00} +\ket{11}\big) \text{ ,}$$
and if Alice measures $A_0 = X$ and $A_1 = Z$, and Bob measures
$B_0 = (Z+X)/\sqrt{2}$ and $B_1 = (X-Z)/\sqrt{2}$. These operators can
be related to the measurement operators considered in by
$$A_x = M_{1|x} - M_{-1|x} \; \text{and} \; B_y = N_{1|y} - N_{-1|y}$$
and therefore, with , we can write
$$\bra{\Phi} A_{x} \otimes B_{y} \ket{\Phi} = \sum_{a,b} ab \ p(a,b|x,y)
    \label{eq:corr_to_prob}$$ and the vector
$\mathcal P = \left\{ p(a,b|x,y)\right\}$ can be derived by solving the
systems of equations defined by the previous Equations.
# [[#eq:corr_chsh][[eq:corr_chsh]]] and
# [[#eq:corr_to_prob][[eq:corr_to_prob]]], and the normalization
# constraints in Equations [[#eq:norm_cons_1][[eq:norm_cons_1]]] and
# [[#eq:norm_cons_2][[eq:norm_cons_2]]].

With local correlations, the following Bell inequality stands
\cite{bell_einstein_1964} $$\label{eq:chsh}
     \left< A_0 B_0\right> + \left< A_1 B_0\right> + \left< A_0 B_1 \right> - \left< A_1 B_1 \right>  \leq 2,$$
which will be referred to as the CHSH inequality.

On the other hand, with a quantum behaviour the Tsirelson's inequality
is always fulfilled, and \cite{cirelson_quantum_1980}
$$\left< A_0 B_0\right> + \left< A_1 B_0\right> + \left< A_0 B_1 \right>  - \left< A_1 B_1 \right>  \leq 2 \sqrt{2},$$
for which the upper bound, called the Tsirelson's bound, is achieved by
the previous shared state and measurement.

Therefore, the quantum strategy mentioned above achieves a maximum
violation of the Bell ,

** Mayers-Yao correlations
   :PROPERTIES:
   :CUSTOM_ID: mayers-yao-correlations
   :END:

For Mayers-Yao's self-test, the inputs are $x,y \in \{0,1,2\}$, the
possible outputs $a,b \in \{0,1\}$ and the expected correlations

$$\label{eq:mayers-yao-correlations}
\begin{aligned}
 &\bra{\Phi} A_z \otimes B_z \ket{\Phi} & = 1 &\ \forall z \in \{0,1,2\} \\
\bra{\Phi} A_x \otimes \mathbbm{1} \ket{\Phi}  = & \bra{\Phi} \mathbbm{1} \otimes B_y \ket{\Phi} & = 0  &\ \forall x,y  \\
\bra{\Phi} A_0 \otimes B_1 \ket{\Phi} = & \bra{\Phi} A_1 \otimes B_0 \ket{\Phi} & = 0  &\\
\bra{\Phi} A_0 \otimes B_2\ket{\Phi} = & \bra{\Phi} A_1 \otimes B_2 \ket{\Phi} & = \dfrac{1}{\sqrt{2}} &\\
\bra{\Phi} A_2 \otimes B_0 \ket{\Phi} = & \bra{\Phi} A_2 \otimes B_1 \ket{\Phi} & = \dfrac{1}{\sqrt{2}} \text{.} & \\
\end{aligned}$$

These correlations can be achieved whenever Alice and Bob share the
state
$$\ket{\Phi} = \dfrac{1}{\sqrt{2}} \left( \ket{00} +\ket{11}\right)\text{,}$$
and their measurement observables are $$\begin{aligned}
        A_0 = X_A   \ , \  A_1 = Z_A  , \ A_2 = \dfrac{1}{\sqrt{2}}  (X_A + Z_A), \\
        B_0 = X_B   , \  B_1 = Z_B  \ , \ B_2 = \dfrac{1}{\sqrt{2}}  (X_B + Z_B) .\\
\end{aligned}$$

* Non-locality detection
  :PROPERTIES:
  :CUSTOM_ID: sec:nonloc-detection
  :END:

According to the Propositions, it is possible to
detect a non-local behaviour using linear programming (see ).

** Linear Programming formulation
   :PROPERTIES:
   :CUSTOM_ID: primal-LP
   :END:

Let $\mathcal P$ be the behaviour for which one want to learn whether it
is local, and let $\mathbbm{1}$ be the behaviour corresponding to the
random outcome strategy. Observe that $\mathbbm{1}$ is a local
behaviour. One can test if a behaviour $\mathcal P$ is nonlocal by
solving the following linear program $$\label{eq:primal}
    \begin{aligned}
            & \min_{\alpha,\overrightarrow{\mu}} \; \alpha \\
	  s.t.  &
        \begin{cases}
            (1-\alpha) \mathcal{P}+ \alpha \mathbbm{1} & \leq \sum_\lambda\mu_\lambda \mathbf{d_\lambda} \\
            \sum_\lambda \mu_\lambda & = 1 \\
            \alpha & \leq 1 \\
            \mu_\lambda,\ \alpha & \geq 0 \quad \forall \lambda
        \end{cases}
    \end{aligned}$$ that expresses how much $\mathcal P$ can be mixed
with a random behavior to become local. In the case of an optimal value
of $\alpha^* = 0$, $\mathcal{P}$ is a local behaviour since it can be
written as
$$\mathcal{P} =  \sum_\lambda \mu^*_\lambda \mathbf{d_\lambda} \text{ ,}$$
where the $\mathbf{\mu^*_\lambda}$ are the coefficients found at the
optimum; whereas an optimal value of $\alpha^* > 0$ means that
$\mathcal{P}$

** CHSH correlations
   :PROPERTIES:
   :CUSTOM_ID: CHSH_primal
   :END:

The behaviour obtained by solving the system of equations induced by the
quantum correlations exposed in is

|  |       |  |  |        |                           |
|  |       |  |  | (1, 1) |                           |
|  | (0,0) |  |  |        | $\frac{\cos^2(\pi/8)}{2}$ |
|  | (0,1) |  |  |        | $\frac{\cos^2(\pi/8)}{2}$ |
|  | (1,0) |  |  |        | $\frac{\cos^2(\pi/8)}{2}$ |
|  | (1,1) |  |  |        | $\frac{\sin^2(\pi/8)}{2}$ |
#+CAPTION: CHSH probability distribution

and solving with the aforementioned behaviour gives an optimal value of
$$\alpha^*_{CHSH} \approx 1 - \frac{1}{\sqrt{2}} \text{ .}$$

