projects/selftest.org
** Mayers-Yao's correlations
   :PROPERTIES:
   :CUSTOM_ID: mayers-yaos-correlations
   :END:

Similarly, the behaviour obtained by solving the system of equations
induced by the quantum correlations shown in is given in and gives an
optimal value of $$\label{eq:opt-primal-my}
    \alpha^*_{MY} \approx 0.1715 \text{ .}$$

<<table:my-prob-dist>>
|  |         |  |  |       |                           |
|  |         |  |  | (1,1) |                           |
|  | $(0,0)$ |  |  |       | $1/2$                     |
|  | $(0,1)$ |  |  |       | $1/4$                     |
|  | $(0,2)$ |  |  |       | $\frac{\cos^2(\pi/8)}{2}$ |
|  | $(1,0)$ |  |  |       | $1/4$                     |
|  | $(1,1)$ |  |  |       | $1/2$                     |
|  | $(1,2)$ |  |  |       | $\frac{\cos^2(\pi/8)}{2}$ |
|  | $(2,0)$ |  |  |       | $\frac{\cos^2(\pi/8)}{2}$ |
|  | $(2,1)$ |  |  |       | $\frac{\cos^2(\pi/8)}{2}$ |
|  | $(2,2)$ |  |  |       | $1/2$                     |
#+CAPTION: Mayers-Yao probability distribution

* Inequalities from duality
  :PROPERTIES:
  :CUSTOM_ID: seq:ineq-dual
  :END:

The linear program for non-locality detection also comes in a useful
dual form

$$\label{eq:dual}
    \begin{aligned}
          & \max_{\gamma,\mathbf{y}} \; \mathcal{P}\cdot \mathbf{y} + \gamma - \omega\\
     s.t. &
        \begin{cases}
            (\mathcal{P} - \mathbbm{1}) \cdot \mathbf{y} - \omega & \leq 1 \\
            \gamma + \mathbf{d_\lambda} \cdot \mathbf{y} & \leq 0 \ \ \forall \lambda \\
            \mathbf{y} \in \mathbb{R}_+^n, \gamma \in \mathbb{R}, \omega \geq 0
        \end{cases}
    \end{aligned}$$ that can be interpreted as a way to express Bell
inequalities. Letting $\delta^*$ be the optimal objective value, we can
write
$$\mathcal{P}\cdot \mathbf{y^*} \ \leq \  \delta^* + \omega^* - \gamma^*\text{ .}
\label{eq:ineq_dual_1}$$

Given that an inequality can be multiplied by a positive value, there
exist many different inequalities we could derive, since
$$\begin{aligned}
        &\mathcal{P}\cdot \mathbf{y} &\ \leq \ &  \delta^* + \omega - \gamma \\
        \Leftrightarrow \hspace{0.2cm} & \ \ M  \,( \mathcal{P}\cdot \mathbf{y} )&\ \leq \ &M\, (\delta^* + \omega - \gamma ) \ \ \forall M \in \mathbb{R}^+ \text{ .}
    \end{aligned}$$

** CHSH correlations
   :PROPERTIES:
   :CUSTOM_ID: chsh-correlations-1
   :END:

The optimal solution is given by $\mathbf{y^*_{CHSH}}$ in ,
$\gamma^*_{CHSH} \approx - 2 \sqrt{2}$ and $\omega^*_{CHSH} =0$.\\
Therefore, we obtain the following Bell inequality
$$\mathcal{P} \cdot \mathbf{y^*_{CHSH}} \ \lesssim\ 3.1213
    \label{eq:chsh_ineq1}$$ Multiplying by
$$M = \dfrac{\gamma^*_{CHSH}}{\delta^* + \omega^*_{CHSH} - \gamma^*_{CHSH}}$$
gives
$$\mathcal{P} \cdot \mathbf{z^*_{CHSH}} \ \lesssim\ 2 \sqrt{2} \text{ ,}$$
where $$\mathbf{z^*_{CHSH}} = M \, \mathbf{y^*_{CHSH}} \text{ .}$$

<<tab:CHSH_dual>>
|  |         |  |  |         |         |
|  |         |  |  | $(1,1)$ |         |
|  | $(0,0)$ |  |  |         | $1.414$ |
|  | $(0,1)$ |  |  |         | $0$     |
|  | $(1,0)$ |  |  |         | $1.414$ |
|  | $(1,1)$ |  |  |         | $0$     |
#+CAPTION: Optimal solution of the dual

Using this dual with a local strategy such as

|  |         |  |  |         |       |
|  |         |  |  | $(1,1)$ |       |
|  | $(0,0)$ |  |  |         | $0$   |
|  | $(0,1)$ |  |  |         | $0$   |
|  | $(1,0)$ |  |  |         | $1/2$ |
|  | $(1,1)$ |  |  |         | $0$   |
#+CAPTION: Example of a local behaviour

we obtain optimal values $\gamma_{loc}^* = -1$ and $\omega_{loc}^* = 0$.
Hence, if $\mathcal{P}$ is local, we have
$$\mathcal{P}_{loc} \cdot \mathbf{y^*_{loc}} \leq 2$$

