projects/selftest.html

<div id="outline-container-mayers-yaos-correlations" class="outline-3">
<h3 id="mayers-yaos-correlations">Mayers-Yao's correlations</h3>
<div class="outline-text-3" id="text-mayers-yaos-correlations">
<p>
Similarly, the behaviour obtained by solving the system of equations
induced by the quantum correlations shown in is given in and gives an
optimal value of \[\label{eq:opt-primal-my}
    \alpha^*_{MY} \approx 0.1715 \text{ .}\]
</p>

<p>
<a id="orgdb9d051"></a>
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">(1,1)</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">\((0,0)\)</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">\(1/2\)</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">\((0,1)\)</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">\(1/4\)</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">\((0,2)\)</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">\(\frac{\cos^2(\pi/8)}{2}\)</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">\((1,0)\)</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">\(1/4\)</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">\((1,1)\)</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">\(1/2\)</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">\((1,2)\)</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">\(\frac{\cos^2(\pi/8)}{2}\)</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">\((2,0)\)</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">\(\frac{\cos^2(\pi/8)}{2}\)</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">\((2,1)\)</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">\(\frac{\cos^2(\pi/8)}{2}\)</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">\((2,2)\)</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">\(1/2\)</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>

<div id="outline-container-seq:ineq-dual" class="outline-2">
<h2 id="seq:ineq-dual">Inequalities from duality</h2>
<div class="outline-text-2" id="text-seq:ineq-dual">
<p>
The linear program for non-locality detection also comes in a useful
dual form
</p>

<p>
$$\label{eq:dual}
    \begin{aligned}
          &amp; max<sub>&gamma;,\mathbf{y}</sub> \; \mathcal{P}&sdot; \mathbf{y} + &gamma; - &omega;<br />
     s.t. &amp;
</p>
\begin{cases}
    (\mathcal{P} - \mathbbm{1}) \cdot \mathbf{y} - \omega & \leq 1 \\
    \gamma + \mathbf{d_\lambda} \cdot \mathbf{y} & \leq 0 \ \ \forall \lambda \\
    \mathbf{y} \in \mathbb{R}_+^n, \gamma \in \mathbb{R}, \omega \geq 0
\end{cases}
<p>
\end{aligned}\[ that can be interpreted as a way to express Bell
inequalities. Letting $\delta^*$ be the optimal objective value, we can
write
\]\mathcal{P}&sdot; \mathbf{y^*} \ &le; \  &delta;<sup>*</sup> + &omega;<sup>*</sup> - &gamma;<sup>*</sup>\text{ .}
\label{eq:ineq_dual_1}$$
</p>

<p>
Given that an inequality can be multiplied by a positive value, there
exist many different inequalities we could derive, since
\[\begin{aligned}
        &\mathcal{P}\cdot \mathbf{y} &\ \leq \ &  \delta^* + \omega - \gamma \\
        \Leftrightarrow \hspace{0.2cm} & \ \ M  \,( \mathcal{P}\cdot \mathbf{y} )&\ \leq \ &M\, (\delta^* + \omega - \gamma ) \ \ \forall M \in \mathbb{R}^+ \text{ .}
    \end{aligned}\]
</p>
</div>

<div id="outline-container-chsh-correlations-1" class="outline-3">
<h3 id="chsh-correlations-1">CHSH correlations</h3>
<div class="outline-text-3" id="text-chsh-correlations-1">
<p>
The optimal solution is given by \(\mathbf{y^*_{CHSH}}\) in ,
\(\gamma^*_{CHSH} \approx - 2 \sqrt{2}\) and \(\omega^*_{CHSH} =0\).<br />
Therefore, we obtain the following Bell inequality
\[\mathcal{P} \cdot \mathbf{y^*_{CHSH}} \ \lesssim\ 3.1213
    \label{eq:chsh_ineq1}\] Multiplying by
\[M = \dfrac{\gamma^*_{CHSH}}{\delta^* + \omega^*_{CHSH} - \gamma^*_{CHSH}}\]
gives
\[\mathcal{P} \cdot \mathbf{z^*_{CHSH}} \ \lesssim\ 2 \sqrt{2} \text{ ,}\]
where \[\mathbf{z^*_{CHSH}} = M \, \mathbf{y^*_{CHSH}} \text{ .}\]
</p>

<p>
<a id="org1ffe76b"></a>
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">\((1,1)\)</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">\((0,0)\)</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">\(1.414\)</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">\((0,1)\)</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">\(0\)</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">\((1,0)\)</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">\(1.414\)</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">\((1,1)\)</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">\(0\)</td>
</tr>
</tbody>
</table>
<p>
Using this dual with a local strategy such as
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">\((1,1)\)</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">\((0,0)\)</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">\(0\)</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">\((0,1)\)</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">\(0\)</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">\((1,0)\)</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">\(1/2\)</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">\((1,1)\)</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">\(0\)</td>
</tr>
</tbody>
</table>
<p>
we obtain optimal values \(\gamma_{loc}^* = -1\) and \(\omega_{loc}^* = 0\).
Hence, if \(\mathcal{P}\) is local, we have
\[\mathcal{P}_{loc} \cdot \mathbf{y^*_{loc}} \leq 2\]
</p>
</div>
</div>
