projects/selftest.org
** Mayers-Yao's correlation
   :PROPERTIES:
   :CUSTOM_ID: mayers-yaos-correlation
   :END:

The optimal solution of the is given by $\mathbf{y^*_{MY}}$ in ,
$\gamma^*_{MY} \approx 3.313$ and $\omega^*_{MY} =0$. Besides, we can
notice that $\gamma^*_{MY} \approx 8 \sqrt{\alpha^*_{MY}}$, where
$\alpha^*_{MY}$ comes from . Therefore, we obtain the following Bell
inequality $$\mathcal{P} \cdot \mathbf{y^*_{MY}} \ \lesssim \ 3.49$$

<<tab:MY_dual>>
|  |         |  |  |         |         |
|  |         |  |  | $(1,1)$ |         |
|  | $(0,0)$ |  |  |         | $0$     |
|  | $(0,1)$ |  |  |         | $0$     |
|  | $(0,2)$ |  |  |         | $0$     |
|  | $(1,0)$ |  |  |         | $0$     |
|  | $(1,1)$ |  |  |         | $0$     |
|  | $(1,2)$ |  |  |         | $1.657$ |
|  | $(2,0)$ |  |  |         | $0$     |
|  | $(2,1)$ |  |  |         | $0$     |
|  | $(2,2)$ |  |  |         | $1.657$ |
#+CAPTION: Optimal solution of the dual for Mayers-Yao's correlations

With a local strategy, we obtain again the following inequality
$$\mathcal{P}_{loc} \cdot \mathbf{y^*_{loc}} \lesssim 2$$

From the optimal solution $\mathbf{y^*_{MY}}$ obtained with the quantum
correlations shown in , one can notice that the input $x=0$ on Alice's
side is never used. Therefore, one could assume that Alice needs only
two measurements instead of three to reproduce Mayers-Yao's
correlations. Similarly, it can be noticed that the input $y=1$ is never
used by Bob in the optimal strategy.

** Restricted inputs on Alice side for Mayers-Yao's self-test
   :PROPERTIES:
   :CUSTOM_ID: restricted-inputs-on-alice-side-for-mayers-yaos-self-test
   :END:

In this section, Bob still has inputs $y \in \{0,1,2\}$ but Alice's
inputs are restricted to $x
\in \{1,2\}$, meaning that Alice only measures $A_0=A_1=Z$ and
$A_2 = (X+Z)/\sqrt{2}$. Hence, we have less correlations to consider in
the linear programs and the basis $\{p(a,b|x,y)\}$ will have a smaller
dimension, but the primal and the dual keep the same form.

The primal gives
$\alpha^*_{MY,\{1,2;0,1,2\}} \approx 0.1715 \approx \alpha^*_{MY}$ and
the dual gives $\gamma^*_{MY,\{1,2;0,1,2\}} \approx 3.313$ ,
$\omega^*_{MY,\{1,2;0,1,2\}} =0$ and $\mathbf{y^*_{MY,\{1,2;0,1,2\}}}$
in .

<<tab:MY_dual_res>>
|  |         |  |  |         |         |
|  |         |  |  | $(1,1)$ |         |
|  | $(1,0)$ |  |  |         | $1.657$ |
|  | $(1,1)$ |  |  |         | $0$     |
|  | $(1,2)$ |  |  |         | $0$     |
|  | $(2,0)$ |  |  |         | $0$     |
|  | $(2,1)$ |  |  |         | $0$     |
|  | $(2,2)$ |  |  |         | $1.657$ |
#+CAPTION: Optimal solution of the dual for Mayers-Yao's correlations
with the inputs on Alice's side restricted to $\{1,2\}$

The results are almost exactly the same as before, except that the
strategy is modified: given an input $(x,y)$, the outputs $(a,b)$ are
not the same as before. However, we still find the same objective value
$\alpha^*_{MY}$ and the same Bell inequality.\\
In , one can notice that Bob does not use the input $y=1$, i.e the
measurement $Y_1=Z$. However, restricting also the inputs on Bob's side
to $y \in \{0,2\}$ does not give exactly the same result. We obtain
$\alpha^*_{MY,\{1,2;0,2\}} \approx 0.1715 \approx \alpha^*_{MY}$ with
the primal and the dual gives $\gamma^*_{MY,\{1,2;0,2\}} \approx 2.485$
, $\omega^*_{MY,\{1,2;0,2\}} =0$ and $\mathbf{y^*_{MY,\{1,2;0,2\}}}$ in
.

<<tab:MY_dual_res2>>
|  |         |  |  |         |         |
|  |         |  |  | $(1,1)$ |         |
|  | $(1,0)$ |  |  |         | $0$     |
|  | $(1,2)$ |  |  |         | $0.828$ |
|  | $(2,0)$ |  |  |         | $0.828$ |
|  | $(2,2)$ |  |  |         | $0.828$ |
#+CAPTION: Optimal solution of the dual for Mayers-Yao's correlations
with the inputs on Alice's side restricted to $x \in \{1,2\}$ and on
Bob's side to $y \in
\{0,2\}$.

Therefore, even though the optimal strategy is changed, the correlations
considered are still nonlocal for the restricted inputs
$x\in\{1,2\}$,$y\in\{0,2\}$.

