projects/selftest.org
** Alternative dual formulation
   :PROPERTIES:
   :CUSTOM_ID: alternative-dual-formulation
   :END:

From the numerical results, we observed that the first constraint of the
is always fulfilled and substituting the inequality by an equality
yields the same results. However, this modified primal form provides an
alternative dual for detecting non-locality

$$\label{eq:dual2}
    \begin{aligned}
        & \max_{\gamma,\mathbf{w}} \; - \mathcal{P}\cdot \mathbf{w} +
        \gamma - \omega  \\
    s.t. &
        \begin{cases}
            (\mathbbm{1} - \mathcal{P}) \cdot \mathbf{w}  - \omega & \leq  1\\
            \gamma + \mathbf{d_\lambda} \cdot \mathbf{w} &\ \leq  0, \ \forall
            \lambda\\
            \mathbf{w} \in \mathbb{R}^n ,\ \gamma \in \mathbb{R}, \omega & \geq 0
        \end{cases}
    \end{aligned}$$

The results from CHSH and Mayers-Yao exhibit that one always has at the
optimum $$\begin{aligned}
        \mathcal{P} \cdot \mathbf{w}^* & =  -\alpha^*, \\
        \mathbbm{1} \cdot \mathbf{w}^* & =  1 - \alpha^*
    \end{aligned}$$ and thus, multiplying the first constraint of the
primal by $\mathbf{w}^*$, one finds that

$$\sum_\lambda \mu^*_\lambda \mathbf{d_\lambda} \cdot \mathbf{w}^* = 0 \text{ ,}$$
which means that the solution $\mathbf{w}^*$ of the dual problem is
orthogonal to the optimal convex sum of deterministic behaviours.

According to the of /strong duality/, the optimal objective value is the
same as the one from the primal and the following inequality is derived
$$-\mathbf{w}^* \cdot \mathcal{P} \leq \alpha^* + \omega^* - \gamma^*$$
The main difference with is that the vector $\mathbf{w^*}$ belongs to
$\mathbb{R}^n$.

For CHSH, we find
$-\mathbf{w^* _{CHSH}}\cdot \mathcal{P} \leq \alpha^*_{CHSH}$ and for
Mayers-Yao's,
$-\mathbf{w^*_{MY}} \cdot \mathcal{P} \leq  \alpha^*_{MY}$.

* Robustness against white noise
  :PROPERTIES:
  :CUSTOM_ID: sec:noise
  :END:

The aim of this section is to study robustness against the addition of
white noise in a communication channel. The noise of the quantum channel
is denoted by $\alpha$, and thus we define the accuracy of the channel
by $\mathcal{V} = 1 -
\alpha$, e.g. and accuracy of $\mathcal{V} = 1$ corresponds to a
lossless quantum channel. In experiments using a singlet state generated
by two entangled photons, the noise can originate from imperfect
operations on the photon source and detectors. Hence generating a pure
singlet state is very difficult in practice.\\
This noise effect can be modeled by the following mixed state, called a
Werner state, $$\label{eq:werner-state}
    \rho = \mathcal{V} \ket{\Phi}\bra{\Phi} + (1-\mathcal{V}) \mathbbm{1}\text{ ,}$$
where $\ket{\Phi}$ is a maximally entangled state and $\mathbbm{1}$ a
fully randomized behaviour.

The aim is to check for which amount of noise this state produces
nonlocal behaviour in CHSH and Mayers-Yao scenario. The study of the
robustness against white noise can be done by two different manners :

1. Start with $\mathcal{V} = 1$ and a given precision $\delta$. While
   the result of the primal is an $\alpha > 0$, i.e., the behaviour
   $\mathcal P$ generated by $\rho$ and ideal measurements is non local,
   set $\mathcal{V} = \mathcal{V} - \delta$. This simple algorithm is
   useful to draw a curve as shown in , but requires to solve
   $O(\delta^{-1})$ nonlinear problems, which is not time-wise
   negligible.

2. Knowing that the visibility $\mathcal{V}$ is in the range $[0, 1]$,
   and that there exists a minimal value $\mathcal{V}^*$ such that for
   all $\mathcal{V} > \mathcal{V}^*$, the behaviour $\mathcal P$
   generated with state $\rho$ ( ) and ideal measurements is not local,
   one can use a binary search to find $\mathcal{V}^*$ . This allows to
   proceed with a logarithmic number of iterations and an arbitrary
   large precision e.g., a twenty-digit accuracy with only 55
   iterations.

The implementation of the first method yielded the curves represented in
.

[fig:curve-noise]

Concerning the CHSH's correlations, we obtained
$$\mathcal V ^*_{CHSH} \approx 0.71  \approx \frac{1}{\sqrt{2}}\text{ ,}$$
while comparatively, Mayer-Yao's correlations yield
$$\mathcal{V}^*_{MY} \approx 0.82\text{ .}$$ As a conclusion, the
maximally entangled state is more robust to noise for CHSH correlations
than for Mayers-Yao's correlations. The value $\mathcal{V}^*$ can be
interpreted as the visibility lower bound, meaning that if the amount of
noise is lower than $1-\mathcal{V}^*$, the violation of a Bell
inequality remains detectable in an experiment.

Besides, experiments reproducing the maximum violation of a Bell
inequality for the CHSH game have been realized without the need of
calibrated devices \cite{shadbolt2012}, and the experimental visibility
they observed matches with our result.

In each case, one can notice that $\mathcal{V}^* = 1 - \alpha^*$ where
$\alpha^*$ was the optimal objective obtained in . The study of the
robustness is equivalent to the primal detecting non-local behaviour
since it was written using a convex combination of the behaviour and a
fully randomized behaviour, which is actually a white noise. Therefore,
the optimal value $\alpha^*$ of the primal corresponds to the maximal
amount of noise tolerated for violating the Bell inequality. Still, this
study would be necessary whenever one wants to study different kinds of
noise or losses arising from experimental setups: specific noises can be
modeled as specific local behaviours, instead of only white noise
\cite{shadbolt2012}.

* Non-linear programming
  :PROPERTIES:
  :CUSTOM_ID: sec:non-linear
  :END:

Considering , one can transform the vector $\mathcal P$ into a vector of
variables. This converts the initial program into a nonlinear program,
more specifically a quadratic program, and provides as a result a
behavior $\mathcal P$. This kind of transformation adds new difficulties
for the resolution, such as non-convex constraints, but all of these are
left over to the solver.

