projects/selftest.html

<div id="outline-container-finding-the-optimal-probability-distribution" class="outline-3">
<h3 id="finding-the-optimal-probability-distribution">Finding the optimal probability distribution</h3>
<div class="outline-text-3" id="text-finding-the-optimal-probability-distribution">
<p>
Adding the constraints for \(\mathcal P\) to be a probability vector
yields the following nonlinear program $$\label{eq:primal-nl}
	\begin{aligned}
			  &amp; max \; &beta;<sub>CHSH</sub><br />
		s.t.  &amp;
</p>
\begin{cases}
	(1-q) \mathcal P + q \mathbbm{1}
        & = \sum_\lambda \mu_\lambda \mathbf{d}_\lambda \\
	\sum_\lambda \mu_\lambda & = 1 \\
    \sum_{a,b} p(a,b|x,y) & = 1, \; \forall (x,y) \in \{0,1\}^2 \\
	q & \leq 1 \\
	\mu_\lambda \geq 0 \; \forall \lambda, \; q \geq 0
\end{cases}
<p>
	\end{aligned}$$ that one could solve to find the maximal value for
\(\beta_{CHSH}\), whose value is the given by the left-hand side of .
However, it must be remembered that the maximal value one can obtain
doing this is \(\beta_{CHSH} = 4\), where the resulting probability
distribution describes a behavior belonging to
\(\mathcal{NS}\setminus \mathcal{Q}\).
</p>

<p>
Finding the boundaries between the sets \(\mathcal{Q}\) and \(\mathcal{NS}\)
i.e., inequalities violated by behaviors in
\(\mathcal{NS}\setminus \mathcal{Q}\), is an open problem when considering
arbitrary values of \(\Delta\) and \(m\). For bipartite scenarios with
binary outcomes (\(\Delta = 2\), \(m = 2\)),
</p>

<p>
$$\label{eq:bound-ns-q}
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">\text{asin}\braket{A_0 B_0}</td>
</tr>
</tbody>
</table>
<ul class="org-ul">
<li>\text{asin}\braket{A_0 B_1}</li>
<li>\text{asin}\braket{A_1 B_0}</li>
<li>\text{asin}\braket{A_1 B_1} | &le; &pi;,$$ introduced by</li>
</ul>
<p>
\citeauthor{Masanes2003NecessaryAS} in \cite{Masanes2003NecessaryAS},
provides an explicit description of behaviours belonging to
\(\mathcal{Q}\). Moreover, the two sides are equal whenever the behavior
maximally violates the CHSH .
</p>

<p>
While simple to understand, this constraint cannot be enforced by
Gurobi, that cannot handle constraints described by trigonometric
functions. Nonetheless, it will only be used to check whether a behavior
stays in \(\mathcal{Q}\).
</p>

<p>
Taking into consideration both and yields the following procedure to
find the maximal value of \(\beta_{CHSH}\)
</p>

<p>
\(\delta\) is the precision, roughly corresponds to the number of number
of significant digits \(\Pi = 2\) is the starting upper bound
\(\Pi \leftarrow \Pi + \delta\) <i>solve with constraint
\(\beta_{CHSH} \leq \Pi\)</i> $\mathcal P$/: the optimal probability
distribution/
</p>

<p>
[alg:beta-optimal-chsh]
</p>

<p>
The numerical result is, indeed, arbitrary close to \(2 \sqrt 2\)
depending on \(\delta\). One should note that not such equation as is
known for the case \(\Delta = 2\) and \(m=3\), but it is possible to use the
generalized CHSH inequality as depicted by
\citeauthor{wehner_tsirelson_2006} in \cite{wehner_tsirelson_2006}. We
could have use this for the case \(\Delta = m = 2\) even though it will
yield the same result, but we thought it was more interesting to try at
least once another formulation. Considering the case \(\Delta = 2\) and
\(m=3\), we indeed obtained results arbitrary close to \(3 \sqrt 3\), and
the associated probability distribution.
</p>
</div>
</div>

<div id="outline-container-making-a-behavior-local" class="outline-3">
<h3 id="making-a-behavior-local">Making a behavior local</h3>
<div class="outline-text-3" id="text-making-a-behavior-local">
<p>
Looking for the optimal probability distribution with a non-linear
approach led us to a side work, that is, from knowing how many elements
of the behavior one can infer that the behavior is local. Taking into
consideration that a behavior with \(\Delta = m = 2\) is local if and only
if \(\beta_{CHSH} \leq 2\), it suffices to set \(k\) probabilities of, for
instance, the behavior that maximally violates the CHSH inequality, and
solving , where the maximization becomes a minimization. By doing this,
if the optimal value is a \(\beta^*_{CHSH} \leq 2\), then it is possible
to find a full behavior that is local, and its elements are given in the
same time by the solver. Otherwise, one can be sure that it is not
possible to make the behavior local.
</p>

<p>
The results of the implementation with Gurobi yielded on one hand that
with \(k =
4\), where for each \((x,y)\), a single \(p(a,b|x,y)\) is fixed, it is not
anymore possible to find values for the other probabilities such that
the behavior is local, in addition, it only results on the behavior that
gives \(\beta_{CHSH} = 2
\sqrt 2\), since it removes all degrees of freedom for the other
probabilities in the light of the normalization constraints ( ) and ( ).
</p>

<p>
Moreover, fixing only one expectation \(\braket{A_x B_y}\) gives an
optimal of 0 with \(\beta_{CHSH} = 0\), while fixing an arbitrary number
of probabilities among up to 3 expectations yields a local behavior,
with an optimal 0, yet \(\beta_{CHSH} \approx 1.1213\).
</p>

<p>
Besides, thanks to the implementation of , we were able to generate a
behavior \(\mathcal P_{\Delta}\) whose CHSH value is $&beta;<sub>CHSH</sub> = 2
</p>
<ul class="org-ul">
<li>&Delta;$, hence that violates the inequality with an arbitrary small</li>
</ul>
<p>
precision \(\Delta\). It yielded for the both aforementioned cases exactly
the same results.
</p>

<p>
For the case of the Mayers-Yao's correlations, the same result is
obtained when fixing one probability per expectation i.e., the resulting
probability distribution stays unchanged. One the other hand, fixing 3
arbitrary expectation also yields the same optimal objective as given in
, enforcing the behavior to be in \(\mathcal{Q}\), while fixing only 2
arbitrary expectations causes the behavior to be local.
</p>
</div>
</div>
</div>

<div id="outline-container-sec:math-opt" class="outline-2">
<h2 id="sec:math-opt">Mathematical optimization</h2>
<div class="outline-text-2" id="text-sec:math-opt">
<p>
Mathematical optimization aims to maximize (or minimize) the value of a
function<sup><a id="fnr.1" class="footref" href="#fn.1" role="doc-backlink">1</a></sup>, under specific <i>constraints</i>. The simplest instance of
mathematical optimization is <i>linear programming</i>, where both the
objective and the constraints are <i>linear functions</i> of the variables.
</p>

<p>
Both linear optimization and nonlinear optimization will be examined.
</p>

<p>
For all the numerical simulations and the corresponding implementations,
Gurobi \cite{gurobi} (a solver that can handle both linear and quadratic
optimization problems) was used.
</p>
</div>
