projects/selftest.org
** Linear optimization
   :PROPERTIES:
   :CUSTOM_ID: linear-optimization
   :END:

The field of linear optimization grew in tandem with the field of
Computer Science, and the /"programmatic"/ approach to linear
optimization became very popular. As such, it will be explained via
/linear programming/ conventions and notations.

A /linear program/ is written as $$\begin{aligned}
    \max \ or\ \min & \ z = c^T x \\
    s.t. &
    \begin{cases}
    Ax & \leq b \\
    x & \geq 0
    \end{cases}\text{ ,}
\end{aligned} \label{eq:general-primal}$$ where
$c^t = ( c_1, \cdots, c_n )$ corresponds to the /objective function
coefficients/, $x^t = (x_1, \cdots, x_n)$ to the /decision variables/,
$b^t = (b_1, \cdots, b_m)$ to the /value of the constraints/ and
$$A =\begin{pmatrix}a_{11} & \cdots & a_{1n} \\ \hdots & \ddots & \hdots \\ a_{m1} & \cdots & a_{mn} \\ \end{pmatrix}$$
to the /constraint coefficients/. Here, $z$ corresponds to the
/objective function/.

The choice of inequality ($\geq$ or $\leq$) is arbitrary, since one can
always multiply both sides by a negative coefficient and obtain the
other. To obtain an equality, one can use two separate inequalities.

The problem formulated in is generally referred to as the /primal/
problem, and its /dual/ form is $$\begin{aligned}
    \min \ or\ \max & \ z' = v^T b \\
    s.t. &
    \begin{cases}
    A^Tv & \geq c \\
    v & \geq 0
    \end{cases} \text{ .}
\end{aligned} \label{eq:dual-primal}$$

In , the dual form is very important. To switch from one form to the
other, is important since it states that the optimum of either objective
form is the same. The following definitions are preliminaries for its
introduction.

$x\in \mathbbm R^n$ is a feasible solution as long as it satisfies every
constraints of the problem.

$x\in \mathbbm R^n$ is an optimal solution whenever it gives to $z$ its
optimal value.

[th:strong-duality] If there exists a feasible solution for the primal,
then the primal optimal objective and the dual optimal objective are
equal.

Lastly, an important thing to keep in mind is that in linear
optimization, the optimal solution is often an extremal point of a
polytope belonging to $\mathbbm R^n$, whose facets are described by the
constraints.

** Nonlinear optimization
   :PROPERTIES:
   :CUSTOM_ID: nonlinear-optimization
   :END:

Nonlinear optimization, unlike linear optimization, handles with
problems where the constraints are nonlinear functions of the variables,
such as exponentials, trigonometric, or polynomial functions. In , the
formulated problems only deals with quadratic function, which are quite
easy problem to solve.

While linear optimization can be solved in polynomial time
\cite{karmarkar_new_1984}, nonlinear optimization is, except for some
cases, an NP-Hard problem \cite{hochbaum_complexity_2007}. In addition,
there are fundamental issues with nonlinear optimization inherent in
digital computer e.g., floating point arithmetic precision.
Consequently, the techniques for finding the optimal solutions are not
exposed here. The

[fn:1] the /objective function/
