projects/selftest.html

<div id="outline-container-linear-optimization" class="outline-3">
<h3 id="linear-optimization">Linear optimization</h3>
<div class="outline-text-3" id="text-linear-optimization">
<p>
The field of linear optimization grew in tandem with the field of
Computer Science, and the <i>"programmatic"</i> approach to linear
optimization became very popular. As such, it will be explained via
<i>linear programming</i> conventions and notations.
</p>

<p>
A <i>linear program</i> is written as \[\begin{aligned}
    \max \ or\ \min & \ z = c^T x \\
    s.t. &
    \begin{cases}
    Ax & \leq b \\
    x & \geq 0
    \end{cases}\text{ ,}
\end{aligned} \label{eq:general-primal}\] where
\(c^t = ( c_1, \cdots, c_n )\) corresponds to the <i>objective function
coefficients</i>, \(x^t = (x_1, \cdots, x_n)\) to the <i>decision variables</i>,
\(b^t = (b_1, \cdots, b_m)\) to the <i>value of the constraints</i> and
\[A =\begin{pmatrix}a_{11} & \cdots & a_{1n} \\ \hdots & \ddots & \hdots \\ a_{m1} & \cdots & a_{mn} \\ \end{pmatrix}\]
to the <i>constraint coefficients</i>. Here, \(z\) corresponds to the
<i>objective function</i>.
</p>

<p>
The choice of inequality (\(\geq\) or \(\leq\)) is arbitrary, since one can
always multiply both sides by a negative coefficient and obtain the
other. To obtain an equality, one can use two separate inequalities.
</p>

<p>
The problem formulated in is generally referred to as the <i>primal</i>
problem, and its <i>dual</i> form is \[\begin{aligned}
    \min \ or\ \max & \ z' = v^T b \\
    s.t. &
    \begin{cases}
    A^Tv & \geq c \\
    v & \geq 0
    \end{cases} \text{ .}
\end{aligned} \label{eq:dual-primal}\]
</p>

<p>
In , the dual form is very important. To switch from one form to the
other, is important since it states that the optimum of either objective
form is the same. The following definitions are preliminaries for its
introduction.
</p>

<p>
\(x\in \mathbbm R^n\) is a feasible solution as long as it satisfies every
constraints of the problem.
</p>

<p>
\(x\in \mathbbm R^n\) is an optimal solution whenever it gives to \(z\) its
optimal value.
</p>

<p>
[th:strong-duality] If there exists a feasible solution for the primal,
then the primal optimal objective and the dual optimal objective are
equal.
</p>

<p>
Lastly, an important thing to keep in mind is that in linear
optimization, the optimal solution is often an extremal point of a
polytope belonging to \(\mathbbm R^n\), whose facets are described by the
constraints.
</p>
</div>
</div>

<div id="outline-container-nonlinear-optimization" class="outline-3">
<h3 id="nonlinear-optimization">Nonlinear optimization</h3>
<div class="outline-text-3" id="text-nonlinear-optimization">
<p>
Nonlinear optimization, unlike linear optimization, handles with
problems where the constraints are nonlinear functions of the variables,
such as exponentials, trigonometric, or polynomial functions. In , the
formulated problems only deals with quadratic function, which are quite
easy problem to solve.
</p>

<p>
While linear optimization can be solved in polynomial time
\cite{karmarkar_new_1984}, nonlinear optimization is, except for some
cases, an NP-Hard problem \cite{hochbaum_complexity_2007}. In addition,
there are fundamental issues with nonlinear optimization inherent in
digital computer e.g., floating point arithmetic precision.
Consequently, the techniques for finding the optimal solutions are not
exposed here. The
</p>
</div>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1" role="doc-backlink">1</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
the <i>objective function</i>
</p></div></div>


</div>
</div></div>
<div id="postamble" class="status">
<p class="date">Created: 2022-05-10 Tue 11:26</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
